import matplotlib.pyplot as plt
#source - https://www.tutorialspoint.com/matplotlib-make-a-frequency-histogram-from-a-list-with-tuple-elements-in-python

plt.rcParams["figure.figsize"] = [7.00, 3.50]
plt.rcParams["figure.autolayout"] = True

data = [('καὶ', 27933), ('τοῦ', 12284), ('τὸ', 10702), ('τὴν', 9812), ('τῆς', 9427), ('τῶν', 8895), ('ὁ', 8619), ('δὲ', 8090), ('ἐν', 7159), ('τὸν', 6178), ('τῷ', 5228), ('τὰ', 5227), ('γὰρ', 4641), ('ἡ', 4275), ('πρὸς', 4086), ('μὴ', 4068), ('εἰς', 3734), ('τῇ', 3585), ('τοῖς', 3522), ('μὲν', 3426), ('ὡς', 2951), ('ἐπὶ', 2793), ('ὅτι', 2769), ('οὐ', 2716), ('ἢ', 2715), ('εἰ', 2562), ('οὐκ', 2500), ('κατὰ', 2493), ('διὰ', 2466), ('τοὺς', 2375), ('οἱ', 2374), ('ἐκ', 2306), ('πολιτισµικής', 2034), ('ἀλλὰ', 2007), ('περὶ', 1824), ('οὖν', 1768), ('θεοῦ', 1765), ('τὰς', 1740), ("ἀλλ'", 1670), ('αὐτοῦ', 1410), ('τοῦτο', 1382), ('ἀπὸ', 1353), ('τί', 1271), ('ἵνα', 1212), ('παρὰ', 1171), ('του', 1097), ('εἶναι', 1081), ('και', 1062), ('ταῖς', 1058), ('ἂν', 1045)]
ind = []
fre = []
for item in data:
   ind.append(item[0])
   fre.append(item[1])

plt.bar(ind, fre)

plt.show()
